Revit 2027 API
BuiltInFailures.CopyPasteFailures.CantCopyFrom3dTo2dFam Property
 Can't copy 3D element(s) into a 2D family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantCopyFrom3dTo2dFam { get; }
Public Shared ReadOnly Property CantCopyFrom3dTo2dFam As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantCopyFrom3dTo2dFam {
	FailureDefinitionId^ get ();
}
static member CantCopyFrom3dTo2dFam : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace